import styled from "styled-components";

const Page = styled.section`
  width: 100vw;
  /* height: 150vh; */
  border-bottom: 2px solid black;
`;

const Title = styled.title`
  display: flex;
  justify-content: center;
  font-size: 100px;
  
`;

const H2 = styled.h2`
  display: block;
  font-size: 50px;
`;

const H3 = styled.h3`
  display: block;
  font-size: 30px;
`;

const P = styled.p`
  display: inline-block;
  font-size: 20px;
`;



export function Control() {
  return (
    <>
    <Title>CONTROL</Title>
      <Page>
         <br />
         <br />
         <br /> 
        <H2>감정의 인식 (Emotional Awareness)</H2>
        <P>
        감정의 인식(Emotional Awareness)은 자신의 감정을 인식하고 이해하는 능력을 말합니다. 
        <br/>
        감정을 인식하는 것은 감정적인 반응과 그 원인을 알아내는데 도움이 되며, 감정을 조절하고 적절히 대응하는데 중요한 첫 번째 단계입니다.  
        <br/>이를 위해 아래와 같은 방법들을 활용하여 감정의 인식을 기를 수 있습니다
        </P>
        <H3>자기 관찰(Self-Observation)</H3>
        <P>일상 생활에서 감정을 느끼는 순간에 주목하고 자신의 감정에 대해 깊이 생각해보는 것이 중요합니다. 
        <br/>어떤 상황에서 어떤 감정을 느끼는지 정확히 파악하고 기록하는 것이 도움이 될 수 있습니다.
        </P>

        <H3>감정의 언어화(Emotional Labeling)</H3>
        <P>감정을 느낄 때 어떤 감정인지 정확히 파악하고 그것을 적절한 단어로 표현하는 것이 중요합니다.
        <br/>자신의 감정을 레이블링하고 이름을 붙이는 것은 감정을 이해하는 데 도움이 됩니다.
        </P>

        <H3>몸의 반응 관찰(Body Sensations)</H3>
        <P>감정은 종종 신체적인 반응과 연관되어 있습니다. <br/>
        자신의 신체 반응을 주시하면 감정을 인식하는데 도움이 될 수 있습니다. 긴장, 가슴의 떨림, 속이 메스껍거나 가벼운 느낌 등의 신체적인 반응을 관찰해보세요.</P>

        <H3>정신적 상태와 연관시키기</H3>
        <P>감정은 특정한 생각이나 상황과 밀접하게 연관되어 있을 수 있습니다. <br/>
        자신의 정신적 상태와 생각을 살펴보면 감정을 이해하는 데 도움이 될 수 있습니다.</P>

        <H3>타인과의 상호작용 관찰</H3>
        <P>자신이나 다른 사람들과의 상호작용에서 감정의 변화와 원인을 파악하는 것도 감정의 인식을 향상시키는데 도움이 됩니다.</P>

        <H3>마음을 진정시키는 연습</H3>
        <P>감정의 파도가 오는 것을 인식하고 감정의 흐름을 진정시키기 위해 꾸준히 마음을 훈련하는 연습을 할 수 있습니다. 명상, 규칙적인 운동, 호흡 연습 등이 도움이 될 수 있습니다.</P>
      </Page>
      
       <Page >
         <br />
         <br />
         <br />
       <H2>감정의 표현 (Emotional Expression)</H2>
        <P>
        감정을 표현하는 것은 감정을 외부에 알리는 것으로, 이는 다른 사람들과의 소통과 상호작용에 중요한 역할을 합니다. 감정을 적절하게 표현하고 공유하는 것은 정서적인 결합과 커뮤니케이션에 도움이 됩니다.
        </P>
        <H3>언어적 표현</H3>
        <P>감정을 언어로 표현하는 것은 가장 일반적인 방법 중 하나입니다. 말로 감정을 표현하거나 글이나 메시지를 통해 감정을 전달할 수 있습니다.
        <br /> 예를 들어, "기쁨으로 가득 차 있어요!", "슬픔 때문에 기운이 없어요" 등과 같이 감정을 말로 표현하는 것이 이에 해당합니다.</P>
        
        <H3>얼굴 표정</H3>
        <P>감정은 얼굴 표정으로도 표현됩니다. 웃음, 눈물, 찡그림 등의 표정은 감정을 외부에 보여주는 중요한 방식입니다. 이러한 표정은 다른 사람들에게 감정을 전달하는데 효과적입니다.</P>
        
        <H3>몸의 움직임</H3>
        <P>감정은 몸의 움직임에도 나타납니다. 기뻐할 때의 활발한 움직임, 슬플 때의 우울한 자세 등은 감정을 표현하는 방식으로 작용합니다.</P>
        
        <H3>목소리와 음성</H3>
        <P>감정은 목소리와 음성 톤으로도 표현됩니다. 활기찬 음성으로 말하면 기쁨이나 흥분을 나타낼 수 있고, 음울한 목소리로 말하면 슬픔이나 우울함을 표현할 수 있습니다.</P>
        
        <H3>예술과 창작 활동</H3>
        <P>감정은 또한 예술과 창작 활동을 통해 표현될 수 있습니다. 그림, 음악, 춤, 연극 등은 감정을 표현하고 전달하는 데에 매우 효과적인 매체입니다.</P>
      </Page>

      <Page>
         <br />
         <br />
         <br />
         <H2>감정의 조절 (Emotional Regulation)</H2>
         <P>
        감정의 조절은 감정을 적절하게 인식하고 그에 따라 조절하여 감정을 적절한 수준으로 유지하는 능력을 말합니다. 감정의 조절은 감정이 강한 정도나 지속 시간이 적절하고 상황에 맞도록 조절되는 것을 의미합니다. 
        <br/>이는 긍정적인 감정을 즐기고 부정적인 감정을 처리하는 데 도움이 되며, 사회적 관계, 학업, 직장 생활 등 다양한 측면에서 중요한 역할을 합니다.</P>

        <H3>인식 및 이해</H3>
        <P>감정의 조절은 먼저 자신의 감정을 인식하고 이해하는 데서 시작됩니다. 어떤 상황에서 어떤 감정을 느끼는지 파악하고 그 원인을 이해하는 것이 중요합니다.</P>

        <H3>감정을 표현하는 방법</H3>
        <P>감정을 적절하게 표현하는 것이 감정의 조절에 도움이 됩니다. 자신의 감정을 정확하게 표현하고 타인과 소통하는 것은 감정을 조절하고 해소하는 데 도움이 됩니다.</P>

        <H3>긍정적인 감정 강화</H3>
        <P>긍정적인 감정을 촉진하고 강화하는 것도 감정의 조절에 중요합니다. 즐거움, 흥분, 연민과 같은 긍정적인 감정을 경험하는 것이 정서적인 웰빙과 삶의 만족도를 높일 수 있습니다.</P>

        <H3>스트레스 관리</H3>
        <P>스트레스는 감정에 큰 영향을 미치는 요소입니다. 스트레스를 관리하고 스트레스를 줄이는 기술을 익히는 것이 감정 관리에 도움이 됩니다.</P>

        <H3>긍정적인 자기 대화</H3>
        <P>자신과의 대화 방식에도 영향을 미치는데, 긍정적인 자기 대화를 통해 부정적인 감정을 조절하고 긍정적인 자세를 유지할 수 있습니다.</P>

        <H3>정서적 자기 돌봄</H3>
        <P>정서적인 측면에서 자신을 돌봄으로써 감정 관리를 향상시킬 수 있습니다. 힘든 시기에는 자신에게 적절한 돌봄과 쉼이 필요하며, 자기를 이해하고 사랑하는 자세를 취하는 것이 중요합니다.</P>
      </Page>

      <Page>
         <br />
         <br />
         <br />
        <H2>스트레스 관리 (Stress Management)</H2>
        <P>
        스트레스 관리는 일상 생활에서 발생하는 스트레스를 인식하고 적절히 대처하여 정서적, 신체적, 인지적으로 안정된 상태를 유지하는 방법을 의미합니다.
        <br/> 스트레스는 우리가 직면하는 다양한 상황과 과제로 인해 자연스럽게 발생할 수 있으며, 적절하게 대처하지 않을 경우 신체와 정신에 부정적인 영향을 미칠 수 있습니다.
        </P>

        <H3>신체 활동</H3>
        <P>규칙적인 운동이 스트레스 관리에 도움이 됩니다. 유산소 운동이나 요가, 태극권 등의 신체 활동은 스트레스 호르몬의 분비를 줄이고 긍정적인 감정을 촉진하는 데 도움이 됩니다.</P>

        <H3>숙면과 휴식</H3>
        <P>충분한 휴식과 수면을 취하는 것이 스트레스를 완화하는 데 중요합니다. 스트레스가 많은 상태에서는 자신에게 적절한 휴식을 취하고 충분한 수면을 취하는 것이 필요합니다.</P>

        <H3>시간 관리</H3>
        <P>일과 과제를 효과적으로 계획하고 조절하는 것이 스트레스 관리에 도움이 됩니다. 우선순위를 정하고 계획을 세우며, 하루 일정을 구성하는데에 신경써서 시간을 효율적으로 활용하는 것이 중요합니다.</P>

        <H3>긍정적인 자기 대화</H3>
        <P>스트레스 상태에서도 긍정적으로 자기와 대화하고 자신을 격려하는 것이 중요합니다. 부정적인 자기 대화를 긍정적으로 변화시키는 데에 주의해야 합니다.</P>

        <H3>호흡 연습</H3>
        <P>규칙적이고 깊은 호흡 연습을 통해 심신의 긴장을 풀고 스트레스를 완화할 수 있습니다.</P>

        <H3>취미와 관심사</H3>
        <P>스트레스를 덜어내는데 도움이 되는 취미나 관심사를 가지고 시간을 보내는 것이 좋습니다. 예술, 스포츠, 음악 감상 등 스트레스를 잊게 해주는 활동들은 정서적인 안정을 가져다 줍니다.</P>

        <H3>도움과 지지</H3>
        <P>스트레스 상태에서는 가까운 친구, 가족, 동료들과 이야기하고 지지를 받는 것이 중요합니다. 누군가와 함께 얘기하고 공감받는 것은 스트레스를 감소시키는 데에 큰 도움이 됩니다.</P>

      </Page>

      <Page>
         <br />
         <br />
         <br />
        <H2>긍정적인 감정 강화 (Cultivating Positive Emotions)</H2>
        <P>
        긍정적인 감정 강화는 즐거움, 흥분, 연민 등 긍정적인 감정을 증폭시키고 강화하는 것을 의미합니다. 긍정적인 감정을 강화하는 것은 우리의 정서적 웰빙과 삶의 만족도를 높이는 데에 도움이 됩니다. 
        </P>

        <H3>감사의 태도</H3>
        <P>감사의 마음을 갖고 일상 속에서 주변의 긍정적인 측면들에 주목하는 것이 중요합니다. 하루의 끝에 감사 일기를 쓰거나, 매일 가족, 친구, 일상 생활에서 받은 도움이나 배움 등에 감사하는 시간을 가지는 것이 좋습니다.</P>

        <H3>긍정적인 생각과 자기 대화</H3>
        <P> 부정적인 생각이 들 때 긍정적인 방향으로 자기 대화를 전환하는 것이 중요합니다. 자신을 격려하고 긍정적으로 강화하는 말을 내뱉는 습관을 기르는 것이 도움이 됩니다.</P>

        <H3>즐거운 활동과 취미</H3>
        <P>개인의 취미와 관심사에 시간을 보내는 것이 긍정적인 감정을 높이는 데에 도움이 됩니다. 스트레스 상태에서도 자신에게 즐거움을 주는 취미를 추구하는 것이 중요합니다.</P>

        <H3>긍정적인 사람들과의 교류</H3>
        <P>긍정적인 사람들과 교류하고 소통하는 것은 긍정적인 감정을 느끼는 데에 도움이 됩니다. 서로의 긍정적인 에너지를 나누며 상호작용하고 함께 시간을 보내는 것이 좋습니다.</P>

        <H3>웃음과 유쾌한 경험</H3>
        <P>웃음은 최고의 약이라고 할 정도로 긍정적인 감정을 유발하는데 큰 역할을 합니다. 코미디 영화나 유머 컨텐츠를 감상하거나 유쾌한 경험을 찾는 것이 좋습니다.</P>

        <H3>감정적 기억 회상</H3>
        <P>지난 긍정적인 경험들을 회상하고 기억하는 것은 긍정적인 감정을 증폭시키는데 도움이 됩니다. 기억 속에서 긍정적인 순간들을 다시 떠올려 보는 것이 좋습니다.</P>

        <H3>명상과 기분 전환</H3>
        <P>명상과 기분 전환 연습을 통해 긍정적인 감정을 촉진할 수 있습니다. 긍정적인 상상이나 기분 좋은 장면을 상기시키며 휴식을 취하는 것이 좋습니다.</P>
      </Page>
      
      <Page>
         <br />
         <br />
         <br />
        <H2>정서적 자기 돌봄 (Emotional Self-Care)</H2>
        <P>
        정서적 자기 돌봄은 자신의 감정과 정서적 상태를 케어하고 지켜주는 것을 의미합니다. 우리의 감정과 정서는 삶의 여러 측면에 영향을 미치기 때문에 정서적인 측면에서 자기를 돌보는 것은 중요합니다. 
        </P>

        <H3>감정을 받아들이기</H3>
        <P>부정적인 감정이나 스트레스를 느낄 때 자신을 비난하거나 부정적으로 평가하지 않고, 감정을 받아들이고 이해하는 마음가짐을 갖는 것이 중요합니다.</P>

        <H3>자기 이해</H3>
        <P>자신의 감정과 정서적인 상태를 깊이 이해하고 무엇이 그러한 감정을 유발하는지를 알아내는 것이 도움이 됩니다. 자신과의 솔직한 대화를 통해 내면의 감정에 더 가까이 다가갈 수 있습니다.</P>

        <H3>표현과 소통</H3>
        <P>감정을 내면에 묻어두지 않고 표현하고, 소중한 사람들과 솔직하게 소통하는 것이 중요합니다. 누군가와 이야기를 나누는 것은 정서적인 부담을 덜어내고 해소하는 데에 도움이 됩니다.</P>

        <H3>자기 돌봄 활동</H3>
        <P>감정적인 안정을 위해 자신에게 맞는 활동을 선택하고 실천하는 것이 중요합니다. 명상, 운동, 문화 활동, 취미 활동 등 자기 돌봄을 위한 다양한 활동들을 선택할 수 있습니다.</P>
      </Page>
      
    </>
  );
}