const LifeQuotes = [
  {
    id: 0,
    text: "분노는 마치 바보가 되어버리는 것이다.  - 윌리엄 셰익스피어",
  },

  {
    id: 1,
    text: "분노가 너무 오래 지속되면, 증거조차 파괴된다. - 크리스토퍼 스크립터",
  },

  {
    id: 2,
    text: "슬픔은 우리의 영혼을 깨우친다. - 존 엘리어",
  },

  {
    id: 3,
    text: "슬픔은 우리가 더 깊이 생각하게 해준다. - 토머스 풀러",
  },

  {
    id: 4,
    text: "우리가 두려워하는 것은 빛이 아니라 어둠이다.  - 마리언 윌리엄슨",
  },

  {
    id: 5,
    text: "가장 큰 두려움은 두려워하지 않는 것이다.  - 프랭클린 D. 루스벨트",
  },

  {
    id: 6,
    text: "고통은 새로운 사실을 가르쳐준다. - 노르웨이 속담",
  },

  {
    id: 7,
    text: "고통은 불필요한 짐을 벗게 해주는 치료제이다. - 에이브러햄 링컨",
  },

  {
    id: 8,
    text: "불행은 어려움이 아니라 시련이다. - 세네카",
  },

  {
    id: 9,
    text: "불행은 삶의 일부분이지, 삶 전체가 아니다. - 마이클 J. 폭스",
  },

  {
    id: 10,
    text: "기쁨을 다른 사람과 나누면 두 배로 증가한다. - 알버트 슈바이처",
  },

  {
    id: 11,
    text: "기쁨은 흔히 우리에게 외부에서 찾아오는 것이 아니라 내부에서 나오는 것이다. - 칼라일 지브란",
  },

  {
    id: 12,
    text: "사랑은 믿음과 소망, 두 가지로서 존재한다. - 사무엘 버틀러",
  },

  {
    id: 13,
    text: "사랑은 그러한 관계이다. 당신이 어떻게 대우받는지가 아니라, 어떻게 대우하는지에 달려있다. - 파울로 코엘료",
  },

  {
    id: 14,
    text: "우리는 우리의 선택을 만들지만, 선택은 우리를 만든다. - 스윗 플루톤",
  },
];

export default LifeQuotes;
